In [160]:
#import dependencies
import pandas as pd
import numpy as np

In [161]:
#Import file from resource and review
purchase = "Resources/purchase_data.csv"
purchase = pd.read_csv(purchase)
purchase.tail()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [63]:
#View Header
purchase.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

In [64]:
#Check for missing value
purchase.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [65]:
# List of unique values in each columns
Uniqe_counts_Column = purchase.nunique()
print (Uniqe_counts_Column)

Purchase ID    780
SN             576
Age             39
Gender           3
Item ID        183
Item Name      179
Price          145
dtype: int64

In [66]:
#1 find total number of players
#Create new dataframe for players count unique values
Players_df_Name=purchase['SN'].nunique()
#Pint out the anwers 
print('Total Number of Players = ' , Players_df_Name)

Total Number of Players =  576

In [162]:
#2 ### Purchasing Analysis (Total)
#2.1 Number of Unique Items
#Get unique items from table and print
Players_df_Item = purchase['Item ID'].nunique()
print('Number of Unique Item = ' , Players_df_Item)

Number of Unique Item =  183

In [187]:
#2.2 Average Purchase Price
Avg_Price = purchase['Price'].mean()
Average_Price = Avg_Price
print('Average Purchase Price = ' , Average_Price)

Average Purchase Price =  3.050987179487176

In [188]:
#2.3 Total Number of Purchases
Total_Purchases = purchase['Purchase ID'].count()
print('Total Number of Purchases = ' , Total_Purchases)

Total Number of Purchases =  780

In [189]:
#2.4 Total Revenue
Total_Revenue = purchase['Price'].sum()
print('Total Revenue = ' , Total_Revenue)

Total Revenue =  2379.77

In [190]:
Players_df = purchase.groupby('SN')
print (len(Players_df))

576

In [191]:
#Total Count of Unique players
Players_df_G = Players_df["Gender"].unique()
Total_Gender_Count = Players_df_G.count()
Total_Gender_Count

576

In [192]:
#Summary of Purchasing Analysis 
Summary_df = pd.DataFrame({"Number of Unique Items":[Players_df_Item], "Average Purchase Price":[Average_Price],
                                            "Total Number of Purchases":[Total_Purchases],
                                             "Total Revenue":[Total_Revenue]})
Summary_df.head()

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,183,3.050987,780,2379.77

In [193]:
#Derive Gender count from Gender and SN Data
gender_count_df = purchase.groupby("Gender")["SN"].nunique()
gender_count_df.head()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [169]:
# Gender Percentage i.e (gender_count_df)/Players_df)
gender_percentage_df = (gender_count_df/Total_Gender_Count)* 100
gender_percentage_df.round(2)

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [77]:
#Summarizing gender records in table
Gender_Summary_df = pd.DataFrame({"Gender Count":gender_count_df, "Percentage Gender":gender_percentage_df})
Gender_Summary_df.round(2)

                       Gender Count  Percentage Gender
Gender
Female                           81              14.06
Male                            484              84.03
Other / Non-Disclosed            11               1.91

In [194]:
#Purchasing Analysis (Gender) -(The below each broken by gender)
#Purchase Count
Gen_Pur = purchase.groupby("Gender")["Item Name"]
Gur_Pur_df = Gen_Pur.count()
#Average Purchase Price

In [195]:
#Average Purchase Total per Person by Gender
Gen_Ave = purchase.groupby("Gender")["Price"].mean()
Gen_Ave.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [84]:
#Total Purchase Value
Gen_Total = purchase.groupby("Gender")["Price"].sum()
Gen_Total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [100]:
#Summary of purchases by Gender
Gen_Pur_Summary = pd.DataFrame({"Purchase Count":Gur_Pur_df,"Average Purchase":Gen_Ave,"Total Purchase Value":Gen_Total})
Gen_Pur_Summary

                       Purchase Count  Average Purchase  Total Purchase Value
Gender
Female                            113          3.203009                361.94
Male                              652          3.017853               1967.64
Other / Non-Disclosed              15          3.346000                 50.19

In [196]:
# Age Demographics(Create Brackets (bings) to collate age range)
#The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
#Create bins ito define range i.e. <=15, 15-19, 20-24, 25-29, 30-34, 35-39 >39.
Bins = [0,15,20,25,30,35,40, 45]
Age_Bracket = ["<15","15-19", "20-24", "25-29", "30-34", "35-39", ">=40"]

# Cut purchase data and place the ages into bins
pd.cut(purchase["Age"], Bins, labels = Age_Bracket)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    15-19
778      <15
779    20-24
Name: Age, Length: 780, dtype: category
Categories (7, object): [<15 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < >=40]

In [197]:
#Enter Age bracket in a data frame 
purchase["Age_Bracket"] = pd.cut(purchase["Age"], Bins, labels = Age_Bracket)
purchase.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Bracket
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
5,5,Yalae81,22,Male,81,Dreamkiss,3.61,20-24
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,15-19
8,8,Undjask33,22,Male,21,Souleater,1.10,20-24
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,30-34

In [198]:
#Purchase Count by Age Range
PurCount_Age_Bra = purchase.groupby("Age_Bracket")["Item Name"]
PC_Count = PurCount_Age_Bra.count()
PC_Count

Age_Bracket
<15       86
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
>=40       7
Name: Item Name, dtype: int64

In [199]:
#Average Purchase Price
PurAvg_Price_Age = purchase.groupby("Age_Bracket")["Price"].mean()
PurAvg_Price_Age.round(2)

Age_Bracket
<15      3.09
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
>=40     3.08
Name: Price, dtype: float64

In [200]:
#Total Purchase Value
PurTotal_Price_Age = purchase.groupby("Age_Bracket")["Price"].sum()
PurTotal_Price_Age

Age_Bracket
<15      265.56
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
>=40      21.53
Name: Price, dtype: float64

In [204]:
Summary_Age_Demo = pd.DataFrame({"Purchase Count":PC_Count ,"Average Purchase":PurAvg_Price_Age,"Total Purchase Value":PurTotal_Price_Age})
Summary_Age_Demo.round(2)

             Purchase Count  Average Purchase  Total Purchase Value
Age_Bracket
<15                      86              3.09                265.56
15-19                   200              3.11                621.56
20-24                   325              3.02                981.64
25-29                    77              2.88                221.42
30-34                    52              2.99                155.71
35-39                    33              3.40                112.35
>=40                      7              3.08                 21.53

In [205]:
#Spending Summary 
Spender_Count = purchase.groupby("SN").count()["Price"].rename("Purchase Count")
Spender_Avg_Price = purchase.groupby("SN").mean()["Price"].rename("Average Purchase Price")
Spender_Total= purchase.groupby("SN").sum()["Price"].rename("Total Purchase Value")
#Collate Spending Summary in a dataframe 
Spender_Summary = pd.DataFrame({"Purchase Count":Spender_Count,"Average Purchase Price": Spender_Avg_Price ,
                                   "Total Purchase Value": Spender_Total})
#Display summary 
Spender_Summary.tail().round(2)

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Yathecal82                  3                    2.07                  6.22
Yathedeu43                  2                    3.01                  6.02
Yoishirrala98               1                    4.58                  4.58
Zhisrisu83                  2                    3.94                  7.89
Zontibe81                   3                    2.68                  8.03

In [213]:
# Derive Topspender by Sorting Totalpurchase vlaue by gamers
Top_Five_Spenders = Spender_Summary.sort_values("Total Purchase Value", ascending=False)
Top_Five_Spenders.head (5).round(2)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

In [215]:
# Summary of item purchases 
Item_count = purchase.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count by Item")
Item_avg_price = purchase.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price by Item")
Item_total_price= purchase.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value Item")
#Collate records in dataframe
Item_Summary = pd.DataFrame({"Purchase Count by item":Item_count,
                                   "Average Purchase Price by Item":Item_avg_price,
                                   "Total Purchase Value by Item":Item_total_price,})
#Display Summarized items
Item_Summary.head()

,,Purchase Count by item,Average Purchase Price by Item,Total Purchase Value by Item
Item ID,Item Name,,,
0,Splinter,4,1.28,5.12
1,Crucifer,3,3.26,9.78
2,Verdict,6,2.48,14.88
3,Phantomlight,6,2.49,14.94
4,Bloodlord's Fetish,5,1.70,8.50

In [151]:
# Derive item purchased  by Sorting by item purchase count
Top_Item = Item_Summary.sort_values("Purchase Count by item", ascending=False)
Top_Item.head (5).round(2)

,,Purchase Count by item,Average Purchase Price by Item,Total Purchase Value by Item
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [209]:
# Derive Most profitable  by Sorting total purchase value by item 
Most_valuable_Item = Item_Summary.sort_values("Total Purchase Value by Item", ascending=False)
Most_valuable_Item.head (5).round(2)

,,Purchase Count by item,Average Purchase Price by Item,Total Purchase Value by Item
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [145]:
#Home-Work is complete